Openfoam/twophaseopemfoam9/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)//#0, 
    (400 0 0)//#1, 
    (0 100 0)//#2, 
    (400 100 0)//#3, 
    (0 0 1)//#4, 
    (400 0 1)//#5, 
    (0 100 1)//#6, 
    (400 100 1)//#7, 
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (10 128 1) simpleGrading (1 1 1)
    
);

edges
(
);

boundary
(

    topWall
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }

    botWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    inlet
    {
        type cyclic;
        neighbourPatch  outlet;
        faces
        (
            (0 2 6 4)
        );
    }
    
    outlet
    {
        type cyclic;
        neighbourPatch  inlet;
        faces
        (
            (3 1 5 7)
        );
    }


    fixWall
    {
        type empty;
        faces
        (
            (0 1 3 2)
            (4 6 7 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
