Openfoam/twophaseopemfoam9/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    topWall
    {
        type            zeroGradient;
    }

    botWall
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedJump;
        patchType       cyclic;
        jump            uniform -0.5;
        value           $internalField;
    }

    outlet
    {
        type            fixedJump;
        patchType       cyclic;
        value           $internalField;
    }


    fixWall
    {
        type            empty;
    }


}

// ************************************************************************* //
