Openfoam/twophaseopemfoam9/0/R
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (1.4803e-16 0 0 1.4803e-16 0 1.4803e-16);

boundaryField
{
    topWall
    {
        type            kqRWallFunction;
        value           uniform (1.4803e-16 0 0 1.4803e-16 0 1.4803e-16);
    }
    botWall
    {
        type            kqRWallFunction;
        value           uniform (1.4803e-16 0 0 1.4803e-16 0 1.4803e-16);
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    fixWall
    {
        type            empty;
    }
}


// ************************************************************************* //
