Openfoam/twophaseopemfoam9/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volTensorField;
    location    "0";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 0 0 0);

boundaryField
{
    topWall
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    botWall
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    fixWall
    {
        type            empty;
    }
}


// ************************************************************************* //
