Openfoam/twophaseopemfoam9/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1e-20;
boundaryField
{

    topWall
    {
        type            omegaWallFunction;
        value           uniform 1e-20;
    }

    botWall
    {
        type            omegaWallFunction;
        value           uniform 1e-20;
    }

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }



    fixWall
    {
        type            empty;
    }


}
}


// ************************************************************************* //
